app/controllers/tournaments_controller.rb

SELECT "tournaments".* FROM "tournaments"
---
  def fetch
    @tournaments = Tournament.all

INSERT INTO "tournaments" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "LOL"], ["created_at", "2016-05-02 15:58:00.649547"], ["updated_at", "2016-05-02 15:58:00.649547"]]
---
  def create
    @new_tournament = Tournament.create(entry_params)